In [1]:
import pandas as pd
df = pd.read_csv ('titanic.csv')

In [2]:
from sklearn.preprocessing import LabelEncoder

In [3]:
labelEnc = LabelEncoder ()

In [4]:
leForSex = labelEnc.fit_transform (df.Sex)

In [6]:
leForSex.shape

(891,)

In [9]:
labelEnc.classes_

array(['female', 'male'], dtype=object)

In [10]:
df['sexEncoded'] = leForSex

In [11]:
df.head (2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sexEncoded
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0

#### Dropping null values

In [12]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
sexEncoded       0
dtype: int64

In [13]:
df.Embarked.unique ()

array(['S', 'C', 'Q', nan], dtype=object)

In [14]:
df.dropna (subset=['Embarked'], inplace=True)

In [15]:
df.Embarked.unique ()

array(['S', 'C', 'Q'], dtype=object)

In [16]:
df.shape

(889, 13)

In [17]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
sexEncoded       0
dtype: int64

In [18]:
embarkedEncode = labelEnc.fit_transform (df.Embarked)
df['embarkedEncoded'] = embarkedEncode

In [19]:
df.head ()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sexEncoded,embarkedEncoded
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,2